//
//  ForbiddenWords.swift
//  Sodam
//
//  Created by 손겸 on 1/23/25.
//

import Foundation

struct ForbiddenWords {
    // 주의: 금지어 목록
    static let list: [String] = [
        "시발", "개새끼", "미친놈", "좆", "지랄", "븅신", "병신", "씨발", "니미", "씨팔", "좆까", "엠창",
        "섹스", "자지", "보지", "씹", "딸딸이", "성교", "포르노", "야동", "야설", "자위","조까",
        "죽여", "살인", "폭행", "테러", "폭탄", "총", "칼", "구타", "린치", "자살", "암살", "폭주",
        "마약", "코카인", "대마", "해킹", "사기", "도둑", "절도", "강도", "성폭행", "아동포르노", "불법다운로드",
        "개돼지", "쓰레기", "똥", "오줌", "똥꼬", "똥침", "똥싸", "똥물", "똥개", "똥통","씨발",
        "김정은", "트럼프", "히틀러", "이슬람국가", "테러리스트", "좌파", "우파", "빨갱이", "수꼴", "좌빨",
        "개소리", "개지랄", "개잡놈", "개쓰레기", "개씹", "개좆", "개자지", "개보지", "개씹할", "개씹놈",
        "개씹년", "개씹새끼", "개씹자식", "개씹자지", "개씹보지", "개씹창녀", "개씹창놈", "개씹창년", "개씹창자식",
        "개씹창자지", "개씹창보지", "개씹창녀새끼", "개씹창놈새끼", "개씹창년새끼", "ㅅㅂ", "ㅂㅅ", "ㅅㅅ", "ㄱㅅㄲ",
        "씨빨", "씨", "ㅈㄹ", "쉬발", "발"
    ]
}
